Статистика работы механизмов/Конфигурация/DataProcessors/_ЗагрузкаБалансаДенежныхСредствСК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ЗагрузкаБалансаДенежныхСредствСК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ЗагрузкаБалансаДенежныхСредствСК/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
	   "ДополнительнаяОбработка",
	   "Загрузка остатков денежных средств СК в 1С",
	   "1.05",
	   "",
	   Истина);
	
	// команды
	Команды = РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд();

	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЗагрузитьДенСредстваСКв1СТест", "Загрузить остатки денежных средств СК (тест)",, Ложь, "ВызовСерверногоМетода");
	РаботаСДополнительнымиОтчетамиИОбработками.ДобавитьНовуюКомандуВТаблицу(Команды, "ЗагрузитьДенСредстваСКв1СПрод", "Загрузить остатки денежных средств СК (прод)",, Ложь, "ВызовСерверногоМетода");

	РегистрационныеДанные.Вставить("Команды", Команды);

	Возврат РегистрационныеДанные;

КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыОбработки) Экспорт

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
	Если ПараметрыОбработки = Неопределено Тогда // режим тестирования
		
		ПараметрыКоманды = Новый Структура("Организация", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК"));
		
	Иначе
		
		ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);

	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыКоманды.Организация) Тогда
		ЭтотОбъект.Организация = ПараметрыКоманды.Организация;	
	Иначе
		ЗарегистрироватьОшибку("Для импорта данных в 1С необходимо заполнить параметр команды [Организация].");	
	КонецЕсли;
	
	Если      ИдентификаторКоманды = "ЗагрузитьДенСредстваСКв1СТест" Тогда
		ЭтотОбъект.СтрокаПодключения = СтрокаПодключенияКSQLСерверуТест();
	ИначеЕсли ИдентификаторКоманды = "ЗагрузитьДенСредстваСКв1СПрод" Тогда
		ЭтотОбъект.СтрокаПодключения = СтрокаПодключенияКSQLСерверуПрод();
	КонецЕсли;
	
	ЭтотОбъект.ДатаВыгрузки = ТекущаяДата();
	
	// сессия для регистрации статистики
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ИдентификаторКоманды;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "ДатаВыгрузки, Организация");
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДопДанныеДляСтатистики = Новый Структура;
	ТекстОшибки = Неопределено;
	
	// основной процесс
	ОстаткиДС_СК = ЗагрузитьОстаткиДенСредствСК(ДопДанныеДляСтатистики, ТекстОшибки);
	
	СформироватьВводОстатковДенежныхСредствСК(ДопДанныеДляСтатистики, ТекстОшибки, ОстаткиДС_СК);
	
	// закроем сессию статистики и оповестим об ошибках
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, Ложь, ДопДанныеДляСтатистики, ТекстОшибки);
		
	ОповеститьОбОшибках(Неопределено);
	
КонецПроцедуры

Функция ВыполнитьКонтроль(ИдентификаторКоманды, датаБаланса, ПараметрыОбработки) Экспорт

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");
	КонецЕсли;
	
	Если ПараметрыОбработки = Неопределено Тогда // режим тестирования
		
		ПараметрыКоманды = Новый Структура("Организация", ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ДК"));
		
	Иначе
		
		ПараметрыКоманды = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьПараметрыКоманды(ПараметрыОбработки.ДополнительнаяОбработкаСсылка, ИдентификаторКоманды, ПараметрыОбработки.ГруппаПараметров);
	
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Источник", ПараметрыОбработки.ДополнительнаяОбработкаСсылка);

	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыКоманды.Организация) Тогда
		ЭтотОбъект.Организация = ПараметрыКоманды.Организация;	
	Иначе
		ЗарегистрироватьОшибку("Для контроля данных необходимо заполнить параметр команды [Организация].");	
	КонецЕсли;
	
	Если      ИдентификаторКоманды = "КонтрольТест" Тогда
		ЭтотОбъект.СтрокаПодключения = СтрокаПодключенияКSQLСерверуТест();
	ИначеЕсли ИдентификаторКоманды = "КонтрольПрод" Тогда
		ЭтотОбъект.СтрокаПодключения = СтрокаПодключенияКSQLСерверуПрод();
	КонецЕсли;
	
	// сессия для регистрации статистики
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + "." + ИдентификаторКоманды;
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "ДатаВыгрузки, Организация");
	
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДопДанныеДляСтатистики = Новый Структура;
	ТекстОшибки = Неопределено;
	
	// основной процесс
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(ЭтотОбъект.СтрокаПодключения);
	
	Если Соединение <> Неопределено Тогда
			
		ОстаткиДС_СК = ЗагрузитьОстаткиДенСредствСКНаДату(ДопДанныеДляСтатистики, ТекстОшибки, датаБаланса);
	
		Остатки = ПолучитьСуммуОстатковПоВсемВалютамВРубляхОтображение(ОстаткиДС_СК);
	Иначе
		ТекстОшибки = "Ошибка подключения к базе данных";
		ЗарегистрироватьОшибку(ТекстОшибки);
	КонецЕсли;
	
	// закроем сессию статистики и оповестим об ошибках
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия, Ложь, ДопДанныеДляСтатистики, ТекстОшибки);

	ОповеститьОбОшибках(Неопределено);
	
	Возврат Остатки;
	
КонецФункции


Функция ЗагрузитьОстаткиДенСредствСК(ДопДанныеДляСтатистики, ТекстОшибки) 
	
	// данные для статистики
	ТекстОшибки = Неопределено;	
	
	// Загрузить данные из БД 
	ВремяНачалаВыполнения = ТекущаяДата();	
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(ЭтотОбъект.СтрокаПодключения);
	
	Если Соединение <> Неопределено Тогда
			
		Результат = ЗагрузитьДанныеИзБазыДанных(Соединение);
		
		РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(Соединение);
		
		ДопДанныеДляСтатистики.Вставить("ВремяПолученияДанныхССервераСек", ТекущаяДата() - ВремяНачалаВыполнения);
		
	Иначе
		ТекстОшибки = "Ошибка подключения к базе данных";
		ЗарегистрироватьОшибку(ТекстОшибки);
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьОстаткиДенСредствСКНаДату(ДопДанныеДляСтатистики, ТекстОшибки, датаБаланса) 
	
	// данные для статистики
	ТекстОшибки = Неопределено;
	
	// Загрузить данные из БД 
	ВремяНачалаВыполнения = ТекущаяДата();	
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(ЭтотОбъект.СтрокаПодключения);
	
	Если Соединение <> Неопределено Тогда
			
		Результат = ЗагрузитьДанныеИзБазыДанных(Соединение, датаБаланса);
		
		РаботаСВнешнимиСистемами.ADODBC_ЗакрытьСоединение(Соединение);
		
		ДопДанныеДляСтатистики.Вставить("ВремяПолученияДанныхССервераСек", ТекущаяДата() - ВремяНачалаВыполнения);
		
	Иначе
		ТекстОшибки = "Ошибка подключения к базе данных";
		ЗарегистрироватьОшибку(ТекстОшибки);
		
	КонецЕсли;	

	Возврат Результат;
	
КонецФункции

Функция СтрокаПодключенияКSQLСерверуТест()
	
	Возврат "Driver={SQL Server};Server=AP85;Database=DCIntegration;UID=User1C;PWD=Qwerty123;";
	
КонецФункции

Функция СтрокаПодключенияКSQLСерверуПрод()
	
	Возврат "Driver={SQL Server};Server=AP5;Database=DCIntegration;UID=Import1C;PWD=gR7tnZ7069wIXQbMKamE;";
	
КонецФункции

Функция ПолучитьСчетаДоверительногоУправления(ОстаткиРуб)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТЗ.DepoAccount КАК Счет,
		|	ТЗ.BalanceData КАК ДатаБаланса
		|ПОМЕСТИТЬ _БрокерскиеСчета
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период КАК Период,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация КАК Организация,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер КАК Брокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код КАК Код,
		|	БрокерскиеСчета.Счет КАК Счет,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ОсновнойБрокер КАК ОсновнойБрокер,
		|	КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания КАК ДоговорБрокерскогоОбслуживания,
		|	НЕ(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > БрокерскиеСчета.ДатаБаланса) КАК Закрыт,
		|	БрокерскиеСчета.ДатаБаланса КАК ДатаБаланса
		|ИЗ
		|	_БрокерскиеСчета КАК БрокерскиеСчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(, Организация = &Организация) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Код ПОДОБНО ""%"" + БрокерскиеСчета.Счет + ""%"")
		|			И (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Период <= БрокерскиеСчета.ДатаБаланса)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО (УсловияДоговоровОбщиеСрезПоследних.Договор = КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания)
		|			И (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация = УсловияДоговоровОбщиеСрезПоследних.Организация)
		|			И (УсловияДоговоровОбщиеСрезПоследних.Период <= БрокерскиеСчета.ДатаБаланса)
		|ГДЕ
		|	(УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))";
	 
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ТЗ", ОстаткиРуб);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	счетаДУ = Новый ТаблицаЗначений;
	счетаДУ = ВыборкаДетальныеЗаписи.СкопироватьКолонки();
	счетаДУ.Очистить();
	
	Для каждого строка из ВыборкаДетальныеЗаписи Цикл
		массБрокСчетов = СтрРазделить(строка.Код, ",", ложь);
		
		Для сч = 0 по массБрокСчетов.Количество() - 1 Цикл
			массБрокСчетов[сч] = СокрЛП(массБрокСчетов[сч]);
		КонецЦикла;
		Если НЕ (массБрокСчетов.Найти(строка.Счет) = Неопределено) тогда
			счетДУ = счетаДУ.Добавить();
			ЗаполнитьЗначенияСвойств(счетДУ, строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат счетаДУ;
	
КонецФункции

Функция ПолучитьСуммуОстатковПоВсемВалютамВРубляхОтображение(ОстаткиДС_СК)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Currency КАК Валюта,
		|	ТЗ.OutBalance КАК ИсходящаяСумма,
		|	ТЗ.InBalance КАК ВходящаяСумма,
		|	ТЗ.DepoAccount КАК Счет,
		|	ТЗ.BalanceData КАК Период,
		|	ТЗ.BrokerName КАК ИмяБрокера,
		|	ТЗ.AssuranceCompany КАК Страховая,
		|	ТЗ.Contract КАК Договор,
		|	ТЗ.Imported КАК Импортировано
		|ПОМЕСТИТЬ _ТаблицаИмпорта
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(СУММА(_ТаблицаИмпорта.ИсходящаяСумма * КурсыВалют.Курс * КурсыВалют.Кратность) КАК ЧИСЛО(24, 4)) КАК OutBalance,
		|	ВЫРАЗИТЬ(СУММА(_ТаблицаИмпорта.ВходящаяСумма * КурсыВалют.Курс * КурсыВалют.Кратность) КАК ЧИСЛО(24, 4)) КАК InBalance,
		|	_ТаблицаИмпорта.Счет КАК DepoAccount,
		|	_ТаблицаИмпорта.Период КАК BalanceData,
		|	_ТаблицаИмпорта.Договор КАК Contract,
		|	_ТаблицаИмпорта.ИмяБрокера КАК BrokerName,
		|	_ТаблицаИмпорта.Страховая КАК AssuranceCompany,
		|	""RUB"" КАК Currency,
		|	_ТаблицаИмпорта.Импортировано КАК Imported,
		|	КурсыВалют.Валюта КАК CurReport,
		|	КурсыВалют.Курс * КурсыВалют.Кратность КАК CurExpense
		|ИЗ
		|	_ТаблицаИмпорта КАК _ТаблицаИмпорта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО _ТаблицаИмпорта.Валюта = КурсыВалют.Валюта.Наименование
		|			И (КурсыВалют.Период = _ТаблицаИмпорта.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаИмпорта.Счет,
		|	_ТаблицаИмпорта.Период,
		|	_ТаблицаИмпорта.Договор,
		|	_ТаблицаИмпорта.ИмяБрокера,
		|	_ТаблицаИмпорта.Страховая,
		|	_ТаблицаИмпорта.Импортировано,
		|	КурсыВалют.Валюта,
		|	КурсыВалют.Курс * КурсыВалют.Кратность
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(СУММА(_ТаблицаИмпорта.ИсходящаяСумма * КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность) КАК ЧИСЛО(24, 4)),
		|	ВЫРАЗИТЬ(СУММА(_ТаблицаИмпорта.ВходящаяСумма * КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность) КАК ЧИСЛО(24, 4)),
		|	_ТаблицаИмпорта.Счет,
		|	_ТаблицаИмпорта.Период,
		|	_ТаблицаИмпорта.Договор,
		|	_ТаблицаИмпорта.ИмяБрокера,
		|	_ТаблицаИмпорта.Страховая,
		|	""RUB"",
		|	_ТаблицаИмпорта.Импортировано,
		|	КурсыВалютСрезПоследних.Валюта,
		|	КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность
		|ИЗ
		|	_ТаблицаИмпорта КАК _ТаблицаИмпорта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО _ТаблицаИмпорта.Валюта = КурсыВалютСрезПоследних.Валюта.Наименование
		|			И (КурсыВалютСрезПоследних.Период <= _ТаблицаИмпорта.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ТаблицаИмпорта.Счет,
		|	_ТаблицаИмпорта.Период,
		|	_ТаблицаИмпорта.Договор,
		|	_ТаблицаИмпорта.ИмяБрокера,
		|	_ТаблицаИмпорта.Страховая,
		|	_ТаблицаИмпорта.Импортировано,
		|	КурсыВалютСрезПоследних.Валюта,
		|	КурсыВалютСрезПоследних.Курс * КурсыВалютСрезПоследних.Кратность";
	
	Запрос.УстановитьПараметр("ТЗ", ОстаткиДС_СК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Остатки_руб = РезультатЗапроса.Выгрузить();
	
	Актив = Справочники.ПрочиеАктивы.НайтиПоНаименованию("231.1.  Денежные средства у брокера");
	Валюта = Справочники.Валюты.НайтиПоНаименованию("RUB");
	Организация = ЭтотОбъект.Организация;
	
	СчетаДУ = ПолучитьСчетаДоверительногоУправления(Остатки_руб);
	
	МенВТ = Новый МенеджерВременныхТаблиц;
	ПоместитьСчетаБрокераВТЗ(МенВТ, СчетаДУ);
	остаткиФакт = ПолучитьОстаткиИзРегистраОстатковПрочихАктивов(МенВТ, Актив, Валюта, Организация, СчетаДУ);
	
	Для каждого остаток_руб из Остатки_руб Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СчетБрокера", остаток_руб.DepoAccount);
		ПараметрыОтбора.Вставить("Период", остаток_руб.BalanceData);
		строка = остаткиФакт.НайтиСтроки(ПараметрыОтбора);
		Если строка.Количество() > 0 тогда
			остаток_руб.InBalance = строка[0].СуммаОстаток;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Остатки_руб;

КонецФункции

Функция ПроверкаЗаписиВРегистреОстатковПрочихАктивов(Актив, Валюта, Организация, СчетДУ, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиПрочихАктивов.Организация КАК Организация,
		|	ОстаткиПрочихАктивов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиПрочихАктивов.Актив КАК Актив,
		|	ОстаткиПрочихАктивов.Субъект КАК Субъект,
		|	ОстаткиПрочихАктивов.Валюта КАК Валюта
		|ИЗ
		|	РегистрНакопления.ОстаткиПрочихАктивов КАК ОстаткиПрочихАктивов
		|ГДЕ
		|	ОстаткиПрочихАктивов.Организация = &Организация
		|	И ОстаткиПрочихАктивов.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОстаткиПрочихАктивов.Актив = &Актив
		|	И ОстаткиПрочихАктивов.Валюта = &Валюта
		|	И НАЧАЛОПЕРИОДА(ОстаткиПрочихАктивов.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДУ);
	Запрос.УстановитьПараметр("Период", Период);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПоместитьСчетаБрокераВТЗ(МенВремТаб, СчетаДУ)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенВремТаб;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.ДатаБаланса КАК ДатаБаланса,
		|	СчетаДоверительногоУправления.Счет КАК СчетБрокера
		|ПОМЕСТИТЬ _СчетаДоверительногоУправления
		|ИЗ
		|	&ТЗ КАК СчетаДоверительногоУправления";

	
	Запрос.УстановитьПараметр("ТЗ", СчетаДУ);
 	Запрос.Выполнить();

	
КонецПроцедуры

Функция ПолучитьОстаткиИзРегистраОстатковПрочихАктивов(МенВремТаб, Актив, Валюта, Организация, СчетаДУ)
	
	ОстаткиПрочихАктивов = Новый ТаблицаЗначений;
	
	периодыТЗ = СчетаДУ.Скопировать();
	периодыТЗ.Свернуть("ДатаБаланса");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенВремТаб;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	СУММА(ОстаткиПрочихАктивовОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	СчетаДоверительногоУправления.СчетБрокера КАК СчетБрокера,
		|	&Период КАК Период
		|ИЗ
		|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
		|			&Период,
		|			Актив = &Актив
		|				И Валюта = &Валюта
		|				И Организация = &Организация) КАК ОстаткиПрочихАктивовОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления = СчетаДоверительногоУправления.СчетДоверительногоУправления
		|			И (СчетаДоверительногоУправления.ДатаБаланса = &Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
		|	СчетаДоверительногоУправления.СчетБрокера";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТЗ", СчетаДУ);
	
	
	Для каждого период из периодыТЗ Цикл
		Запрос.УстановитьПараметр("Период", Период.ДатаБаланса);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
		Если  ОстаткиПрочихАктивов.Количество() = 0 тогда
			ОстаткиПрочихАктивов = ВыборкаДетальныеЗаписи.Скопировать();
		Иначе
			Для каждого стр из  ВыборкаДетальныеЗаписи Цикл
				ост = ОстаткиПрочихАктивов.Добавить();
				ЗаполнитьЗначенияСвойств(ост, стр);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	Возврат ОстаткиПрочихАктивов;
	
КонецФункции

Функция ПолучитьОстатокИзРегистраОстатковПрочихАктивов(Актив, Валюта, Организация, СчетДУ, Период)
	
	ОстаткиПрочихАктивов = Новый ТаблицаЗначений;	
		
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОстаткиПрочихАктивовОстатки.Организация КАК Организация,
		|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ОстаткиПрочихАктивовОстатки.Актив КАК Актив,
		|	ОстаткиПрочихАктивовОстатки.Субъект КАК Субъект,
		|	ОстаткиПрочихАктивовОстатки.Валюта КАК Валюта,
		|	СУММА(ОстаткиПрочихАктивовОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	&Период КАК Период
		|ИЗ
		|	РегистрНакопления.ОстаткиПрочихАктивов.Остатки(
		|			&Период,
		|			Актив = &Актив
		|				И Валюта = &Валюта
		|				И Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДУ) КАК ОстаткиПрочихАктивовОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПрочихАктивовОстатки.Организация,
		|	ОстаткиПрочихАктивовОстатки.СчетДоверительногоУправления,
		|	ОстаткиПрочихАктивовОстатки.Актив,
		|	ОстаткиПрочихАктивовОстатки.Субъект,
		|	ОстаткиПрочихАктивовОстатки.Валюта";
	
	Запрос.УстановитьПараметр("Актив", Актив);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДУ", СчетДУ);
	Запрос.УстановитьПараметр("Период", Период);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
		
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

Процедура СформироватьВводОстатковДенежныхСредствСК(ДопДанныеДляСтатистики, ТекстОшибки, ОстаткиДС_СК)
	
	Попытка
		
		ОстаткиДСРубСК = ПолучитьСуммуОстатковПоВсемВалютамВРубляхОтображение(ОстаткиДС_СК);
		
		ТаблицаСоответствия = Новый ТаблицаЗначений;		
				
		КвалификаторыСтроки = Новый КвалификаторыСтроки(10);
		ТаблицаСоответствия.Колонки.Добавить("DepoAccount", Новый ОписаниеТипов("Строка",,КвалификаторыСтроки));
		ОписаниеСчетаДУ = Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления");
		ТаблицаСоответствия.Колонки.Добавить("TrustManageAcc", ОписаниеСчетаДУ);
		ТаблицаСоответствия.Колонки.Добавить("BalanceData", Новый ОписаниеТипов("Дата"));
		
		СуммаПоСчетамДУ = Новый ТаблицаЗначений;		
		КвалификаторыСтроки = Новый КвалификаторыСтроки(3);
		СуммаПоСчетамДУ.Колонки.Добавить("Currency", Новый ОписаниеТипов("Строка",,КвалификаторыСтроки));
		КвалификаторЧисла = Новый КвалификаторыЧисла(24,4);
		СуммаПоСчетамДУ.Колонки.Добавить("OutBalance", Новый ОписаниеТипов("Число",,КвалификаторЧисла));
		СуммаПоСчетамДУ.Колонки.Добавить("InBalance", Новый ОписаниеТипов("Число",,КвалификаторЧисла));
		ОписаниеСчетаДУ = Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления");
		СуммаПоСчетамДУ.Колонки.Добавить("TrustManageAcc", ОписаниеСчетаДУ);
		СуммаПоСчетамДУ.Колонки.Добавить("BalanceData", Новый ОписаниеТипов("Дата"));
		
		СчетаДУ = ПолучитьСчетаДоверительногоУправления(ОстаткиДСРубСК);
		
		Для Каждого остаток из ОстаткиДСРубСК Цикл
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Счет", остаток.DepoAccount);
			ПараметрыОтбора.Вставить("ДатаБаланса", остаток.BalanceData);
			СчетДУ = ?(СчетаДУ.Количество() = 0
						,Неопределено
						, СчетаДУ.НайтиСтроки(ПараметрыОтбора)[0].СчетДоверительногоУправления
					);
			
			строкаТС = ТаблицаСоответствия.Добавить();
			строкаТС.TrustManageAcc = СчетДУ;
			ЗаполнитьЗначенияСвойств(строкаТС, остаток);
			
			ПараметрыОтбора.Очистить();
			ПараметрыОтбора.Вставить("TrustManageAcc", СчетДУ);
			ПараметрыОтбора.Вставить("BalanceData", остаток.BalanceData);

			строки = СуммаПоСчетамДУ.НайтиСтроки(ПараметрыОтбора);
			
			Если НЕ строки.Количество() = 0  тогда
				суммаИсходящая = строки[0].OutBalance;
				суммаВходящая = строки[0].InBalance;
				ЗаполнитьЗначенияСвойств(строки[0], остаток);
				строки[0].OutBalance = суммаИсходящая + остаток.OutBalance;
			Иначе
				стр = СуммаПоСчетамДУ.Добавить();
				ЗаполнитьЗначенияСвойств(стр, остаток);
				стр.TrustManageAcc = СчетДУ;
			КонецЕсли;			
		КонецЦикла;

		
		Для Каждого остаток из СуммаПоСчетамДУ Цикл
			
			Если остаток.TrustManageAcc = Справочники.СчетаДоверительногоУправления.ПустаяСсылка() тогда
				Продолжить;
			КонецЕсли;

			УстДата =  Дата(остаток.BalanceData) + 11 * 60 * 60 + 12; // помещаем на время 11:00:12
			Актив = Справочники.ПрочиеАктивы.НайтиПоНаименованию("231.1.  Денежные средства у брокера");
			ВидПрочегоАктива = Справочники.УчетныеАктивыЕПС.НайтиПоНаименованию("Денежные средства у брокера");
			Валюта = Справочники.Валюты.НайтиПоНаименованию("RUB");
			Организация = ЭтотОбъект.Организация;
			СчетДоверительногоУправления = остаток.TrustManageAcc;
			InBalance = ПолучитьОстатокИзРегистраОстатковПрочихАктивов(Актив, Валюта, Организация, СчетДоверительногоУправления, остаток.BalanceData);
			Сумма = Число((Цел(остаток.OutBalance * 100))/100 - InBalance[0].СуммаОстаток);			
			СуммаДвижения = ?(Сумма < 0, -Сумма, Сумма);
			ВидДвижения = ?(Сумма < 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
						
			Если  ПроверкаЗаписиВРегистреОстатковПрочихАктивов(Актив, Валюта, Организация, СчетДоверительногоУправления, УстДата)
				ИЛИ Сумма = 0 Тогда 
				
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("TrustManageAcc", остаток.TrustManageAcc);
				НТЗ = ТаблицаСоответствия.НайтиСтроки(ПараметрыОтбора);
				Для каждого стр из НТЗ Цикл
					УстановитьПризнакИмпортаДанных(ДопДанныеДляСтатистики, ТекстОшибки, стр);
				КонецЦикла;
				
				Продолжить;
			КонецЕсли;

			НачатьТранзакцию();

			ВводОстатковДенежныхСредствСК = Документы.ВводОстатковАктивовСтраховыхКомпаний.СоздатьДокумент();
			
			ВводОстатковДенежныхСредствСК.Дата = УстДата;
						
			ОстаткиДенежныхСредствНаРасчетныхСчетах						= ВводОстатковДенежныхСредствСК.ОстаткиПрочихАктивов.Добавить();
			
			ОстаткиДенежныхСредствНаРасчетныхСчетах.ИсходящийОстаток 	= остаток.OutBalance;
			ОстаткиДенежныхСредствНаРасчетныхСчетах.Валюта 				= Валюта;
			ОстаткиДенежныхСредствНаРасчетныхСчетах.Актив 				= Актив; 
			ОстаткиДенежныхСредствНаРасчетныхСчетах.ВидПрочегоАктива 	= ВидПрочегоАктива;
			
			ВводОстатковДенежныхСредствСК.СчетДоверительногоУправления	= СчетДоверительногоУправления;
			ВводОстатковДенежныхСредствСК.Дата 							= ТекущаяДата();
			ВводОстатковДенежныхСредствСК.Организация					= ЭтотОбъект.Организация;
			ВводОстатковДенежныхСредствСК.Ответственный 				= ПараметрыСеанса.ТекущийПользователь;
			
			Регистратор = Документы.КорректировкаРегистров.СоздатьДокумент();
			Регистратор.Дата                         = УстДата; 
			Регистратор.Организация  				 = Организация;
			Регистратор.СчетДоверительногоУправления = СчетДоверительногоУправления;
			Регистратор.Ответственный                = ПараметрыСеанса.ТекущийПользователь;
			Регистратор.Комментарий                  = "Ввод денежных средств";
			
			Регистратор.ТаблицаРегистров.Добавить();
			Регистратор.ТаблицаРегистров[0].Имя = "ОстаткиПрочихАктивов";
			Регистратор.Записать();
			
			ВводОстатковДенежныхСредствСК.СвязаннаяКорректировка = Регистратор.Ссылка;
			ВводОстатковДенежныхСредствСК.Записать(РежимЗаписиДокумента.Запись);
			
			НаборОстаткиПрочихАктивов = РегистрыНакопления.ОстаткиПрочихАктивов.СоздатьНаборЗаписей();
			НаборОстаткиПрочихАктивов.Отбор.Регистратор.Установить(Регистратор.Ссылка);
			НаборОстаткиПрочихАктивов.Прочитать();
			НаборОстаткиПрочихАктивов.Очистить();

			Запись = НаборОстаткиПрочихАктивов.Добавить();
			Запись.Период                       = Регистратор.Дата;
			Запись.Организация                  = Регистратор.Организация;
			Запись.СчетДоверительногоУправления = Регистратор.СчетДоверительногоУправления;
			Запись.Актив 						= Актив;
			Запись.Валюта 						= Валюта;
			Запись.ВидДвижения 					= ВидДвижения;
			Запись.Сумма       					= СуммаДвижения;
			НаборОстаткиПрочихАктивов.Записать();
			
			ВводОстатковДенежныхСредствСК.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗафиксироватьТранзакцию();
			
			Если НЕ Запись = Неопределено тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("TrustManageAcc", остаток.TrustManageAcc);
				НТЗ = ТаблицаСоответствия.НайтиСтроки(ПараметрыОтбора);
				Для каждого стр из НТЗ Цикл
					УстановитьПризнакИмпортаДанных(ДопДанныеДляСтатистики, ТекстОшибки, стр);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		Информация  = ИнформацияОбОшибке();
		ТекстОшибки = Информация.Описание;
		
		ЗарегистрироватьОшибку(ТекстОшибки);
		
	КонецПопытки
	
КонецПроцедуры

Процедура УстановитьПризнакИмпортаДанных(ДопДанныеДляСтатистики, ТекстОшибки, остаток)
	
	// данные для статистики
	ТекстОшибки = Неопределено;
	
	ВремяНачалаВыполнения = ТекущаяДата();	
	
	Соединение = РаботаСВнешнимиСистемами.ADODBC_УстановитьСоединение(ЭтотОбъект.СтрокаПодключения);
	
	Если Соединение <> Неопределено Тогда
			
		ЗаписатьПризнакИмпортаДанныхВБД(соединение, остаток);
			
		ДопДанныеДляСтатистики.Вставить("ВремяПередачиДанныхНаСерверСек", ТекущаяДата() - ВремяНачалаВыполнения);
		
	Иначе
		ТекстОшибки = "Ошибка подключения к базе данных";
		ЗарегистрироватьОшибку(ТекстОшибки);
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаписатьПризнакИмпортаДанныхВБД(соединение, остаток)
	
	nvarchar = 202;
	datetime = 133;
	int      = 4;
	
	Попытка
		
		Command = РаботаСВнешнимиСистемами.ADODBC_ПолучитьКомандуОбращенияКХранимойПроцедуре(Соединение, "sp_Set1SMoneyBalanceImported");
		Command.NamedParameters = true;
		
		РаботаСВнешнимиСистемами.ADODBC_ДобавитьВходнойПараметрКоманды(Command, "@balanceData",   nvarchar, 128, Формат(остаток.BalanceData, "ДФ='yyyyMMdd'"));
		РаботаСВнешнимиСистемами.ADODBC_ДобавитьВходнойПараметрКоманды(Command, "@contract",   nvarchar, 50, остаток.TrustManageAcc.КодСчета);
		РаботаСВнешнимиСистемами.ADODBC_ДобавитьВходнойПараметрКоманды(Command, "@depoAccount",   nvarchar, 50, остаток.DepoAccount);
		
		Результат = Command.Execute();
		
	Исключение
		
		Информация  = ИнформацияОбОшибке();
		ТекстОшибки = Информация.Описание;
		
		ЗарегистрироватьОшибку(ТекстОшибки);
		
	КонецПопытки;

КонецПроцедуры

Функция ЗагрузитьДанныеИзБазыДанных(Соединение, датаБаланса = неопределено)
	
	nvarchar = 202;
	datetime = 133;
	int      = 4;
	
	Попытка
		ТаблицаИмпорта = Новый ТаблицаЗначений;
		
		ТаблицаИмпорта.Колонки.Добавить("DataRowGID", Новый ОписаниеТипов("УникальныйИдентификатор"));
		
		КвалификаторыСтроки = Новый КвалификаторыСтроки(3);
		ТаблицаИмпорта.Колонки.Добавить("Currency", Новый ОписаниеТипов("Строка",,КвалификаторыСтроки));
	
		КвалификаторЧисла = Новый КвалификаторыЧисла(24,2);
		ТаблицаИмпорта.Колонки.Добавить("OutBalance", Новый ОписаниеТипов("Число",,КвалификаторЧисла));
		ТаблицаИмпорта.Колонки.Добавить("InBalance", Новый ОписаниеТипов("Число",,КвалификаторЧисла));
	
		КвалификаторыСтроки = Новый КвалификаторыСтроки(10);
		ТаблицаИмпорта.Колонки.Добавить("DepoAccount", Новый ОписаниеТипов("Строка",,КвалификаторыСтроки));
	
		КвалификаторыСтроки = Новый КвалификаторыСтроки(10);
		ТаблицаИмпорта.Колонки.Добавить("Contract", Новый ОписаниеТипов("Строка",,КвалификаторыСтроки));
	
		КвалификаторыСтроки = Новый КвалификаторыСтроки(500);
		ТаблицаИмпорта.Колонки.Добавить("BrokerName", Новый ОписаниеТипов("Строка",,КвалификаторыСтроки));
		ТаблицаИмпорта.Колонки.Добавить("AssuranceCompany", Новый ОписаниеТипов("Строка",,КвалификаторыСтроки));
	
		ТаблицаИмпорта.Колонки.Добавить("BalanceData", Новый ОписаниеТипов("Дата"));
	
		ТаблицаИмпорта.Колонки.Добавить("Imported", Новый ОписаниеТипов("Булево"));
		
		Command = РаботаСВнешнимиСистемами.ADODBC_ПолучитьКомандуОбращенияКХранимойПроцедуре(Соединение, "sp_GetExternalData1SMoneyBalance");
		Если НЕ датаБаланса = Неопределено тогда 
			РаботаСВнешнимиСистемами.ADODBC_ДобавитьВходнойПараметрКоманды(Command, "@BalanceDate",   nvarchar, 128, Формат(датаБаланса, "ДФ=yyyyMMdd"));
		КонецЕсли;
		
		Command.NamedParameters = true;
		
		Результат = Command.Execute();
		
		Если НЕ Результат.EOF() Тогда
			Пока Результат.EOF() = 0 Цикл
				
				Строка  = Новый Структура;
				КолКолонок = Результат.Fields.Count();
								
				Для Инд = 0 По КолКолонок - 1 Цикл
					Строка.Вставить(Строка(Результат.Fields(Инд).Name),Строка(Результат.Fields(Инд).Value));
				КонецЦикла;
				
				СтрокаТЗ = ТаблицаИмпорта.Добавить();
				
				СтрокаТЗ.DataRowGID = Строка.DataRowGID;
				СтрокаТЗ.BrokerName =Строка.BrokerName;
				СтрокаТЗ.DepoAccount =Строка.DepoAccount;
				СтрокаТЗ.AssuranceCompany =Строка.AssuranceCompany;
				СтрокаТЗ.OutBalance =Число(Строка.OutBalance);
				СтрокаТЗ.Currency =Строка.Currency;
				СтрокаТЗ.BalanceData =Дата(Строка.BalanceData);
				СтрокаТЗ.InBalance = Число(Строка.InBalance);
				СтрокаТЗ.Contract = Строка.Contract;
				СтрокаТЗ.Imported = Строка.Imported;

				Результат.MoveNext();
			КонецЦикла;
		КонецЕсли;
		
		
		Возврат(ТаблицаИмпорта);
		
	Исключение
		
		Информация  = ИнформацияОбОшибке();
		ТекстОшибки = Информация.Описание;
		
		ЗарегистрироватьОшибку(ТекстОшибки);
		
	КонецПопытки;
	
КонецФункции

Процедура ЗарегистрироватьОшибку(ТекстОшибки)
	
	Если Не ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки") Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Ошибки", Новый Массив());
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Ошибки.Найти(ТекстОшибки) = Неопределено Тогда
		ЭтотОбъект.ДополнительныеСвойства.Ошибки.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры // ЗарегистрироватьОшибку

Процедура ОповеститьОбОшибках(ЕстьОшибки = Неопределено)
	
	ЕстьОшибки = ЭтотОбъект.ДополнительныеСвойства.Свойство("Ошибки");
	
	Если Не ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("Источник") Тогда
		РаботаСРегламентнымиЗаданиями.ЗарегистрироватьОшибку(ЭтотОбъект.ДополнительныеСвойства.Ошибки, ЭтотОбъект.ДополнительныеСвойства.Источник);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			РаботаСоСтрокамиКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ЭтотОбъект.ДополнительныеСвойства.Ошибки, Символы.ПС));
	КонецЕсли;
	ЭтотОбъект.ДополнительныеСвойства.Удалить("Ошибки");	
	
КонецПроцедуры // ОповеститьОбОшибках

////////////////////////////////////////////////////////////////////////////////////////////////
ЭтотОбъект.ДополнительныеСвойства = Новый Структура;
